test/client.load.yaml
config:
  target: "http://minimal.chat:8888?type=client"
  phases:
    -
      duration: 120
      arrivalRate: 5
      name: "Warm up"
    -
      pause: 10
    -
      duration: 60
      arrivalCount: 30
    -
      duration: 300
      arrivalRate: 10
      name: "High load phase"
scenarios:
  -
    engine: "socketio"
    flow:
      -
        emit:
          channel: "client:message"
          data: "{\"timestamp\":\"2017-07-09T01:51:37.539Z\",\"author\":\"client.FwbvVrxfGjw13HTNmv4a\",\"content\":\"Cool beans!\",\"chat\":\"FwbvVrxfGjw13HTNmv4a\"}"